# Eleman İşlemleri - VBO

In [275]:
import numpy as np
import pandas as pd

In [276]:
a= np.array([1,2,33,444,75])
seri=pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [277]:
seri[0]

1

In [278]:
seri[:2]

0    1
1    2
dtype: int32

In [279]:
seri2=pd.Series([1212,200,150,99],
            index=["r","l","c","e"])
seri2

r    1212
l     200
c     150
e      99
dtype: int64

In [280]:
seri2.index

Index(['r', 'l', 'c', 'e'], dtype='object')

In [281]:
seri2.keys

<bound method Series.keys of r    1212
l     200
c     150
e      99
dtype: int64>

In [282]:
list(seri.items())

[(0, 1), (1, 2), (2, 33), (3, 444), (4, 75)]

In [283]:
seri2.values

array([1212,  200,  150,   99], dtype=int64)

In [284]:
#eleman sorgulama
"r" in seri2

True

In [285]:
#fancy eleman
seri2[["r","c"]]

r    1212
c     150
dtype: int64

In [286]:
seri2["e"]=139
seri2

r    1212
l     200
c     150
e     139
dtype: int64

## Pandas DataFrame Oluşturma

In [287]:
import pandas as pd

In [288]:
l =[1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [289]:
pd.DataFrame(l, columns=["df_name"])

   df_name
0        1
1        2
2       39
3       67
4       90

In [290]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [291]:
df=pd.DataFrame(m,columns=["v1","v2","v3"])
df

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [292]:
#df isimlendirme
df.columns

Index(['v1', 'v2', 'v3'], dtype='object')

In [293]:
df.columns=["a1","a2","a3"]
df

   a1  a2  a3
0   1   2   3
1   4   5   6
2   7   8   9

In [294]:
type(df)

pandas.core.frame.DataFrame

In [295]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['a1', 'a2', 'a3'], dtype='object')]

In [296]:
df.shape

(3, 3)

In [297]:
df.ndim

2

In [298]:
df.size

9

In [299]:
df.values #değerleri çekiyor

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [300]:
type(df.values) #değer tipi

numpy.ndarray

In [301]:
df.head(2)

   a1  a2  a3
0   1   2   3
1   4   5   6

In [302]:
a=np.array([1,2,3,4,5])
a

array([1, 2, 3, 4, 5])

In [303]:
pd.DataFrame(a,columns=["df_a"])

   df_a
0     1
1     2
2     3
3     4
4     5

## Eleman İşlemleri

In [304]:
import pandas as pd
import numpy as np

In [305]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [306]:
soz={"v1":s1,"v2":s2,"v3":s3}
soz

{'v1': array([2, 6, 8, 1, 3]),
 'v2': array([1, 5, 2, 0, 3]),
 'v3': array([7, 5, 5, 5, 4])}

In [307]:
df=pd.DataFrame(soz)
df

   v1  v2  v3
0   2   1   7
1   6   5   5
2   8   2   5
3   1   0   5
4   3   3   4

In [308]:
df[0:1]

   v1  v2  v3
0   2   1   7

In [309]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [310]:
df.index=["a","b","c","d","e"]
df

   v1  v2  v3
a   2   1   7
b   6   5   5
c   8   2   5
d   1   0   5
e   3   3   4

In [311]:
df[:"e"]

   v1  v2  v3
a   2   1   7
b   6   5   5
c   8   2   5
d   1   0   5
e   3   3   4

In [312]:
#silme işlemi
df.drop("a", axis=0) #axis=0 satır
                     #geçiçi silme

   v1  v2  v3
b   6   5   5
c   8   2   5
d   1   0   5
e   3   3   4

In [313]:
df

   v1  v2  v3
a   2   1   7
b   6   5   5
c   8   2   5
d   1   0   5
e   3   3   4

In [314]:
#silme işlemi
df.drop("a", axis=0, inplace=True) #axis=0 satır
df                                 #inplace kalıcı silme

   v1  v2  v3
b   6   5   5
c   8   2   5
d   1   0   5
e   3   3   4

In [315]:
#fancy ile silme 
l=["c","e"]
df.drop(l,axis=0)

   v1  v2  v3
b   6   5   5
d   1   0   5

In [316]:
#değişkenler için
"v1"in df

True

In [317]:
l2=["v1","v4","v2"]

In [318]:
for i in l2:
    print(i in df)

True
False
True

In [319]:
#Yeni değişken oluşturma
df["v4"]=df["v2"]*df["v3"]
df

   v1  v2  v3  v4
b   6   5   5  25
c   8   2   5  10
d   1   0   5   0
e   3   3   4  12

In [320]:
#Değişken silme
df.drop("v1",axis=1)

   v2  v3  v4
b   5   5  25
c   2   5  10
d   0   5   0
e   3   4  12

In [321]:
df

   v1  v2  v3  v4
b   6   5   5  25
c   8   2   5  10
d   1   0   5   0
e   3   3   4  12

## Gözlem ve Değişken Seçimi

In [322]:
import numpy as np
import pandas as pd

In [323]:
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m, columns=["v1","v2","v3"])
df

   v1  v2  v3
0   3   6  28
1  14  16  27
2  19   9  14
3  16  23  14
4  25  25  26
5   1  10   2
6  28  17   7
7  21  19   2
8   1  29   6
9  24  10  14

#?np.random.randint

In [325]:
#loc: seçim yapmak
df.loc[0:3] #3 dahil [0,3]

   v1  v2  v3
0   3   6  28
1  14  16  27
2  19   9  14
3  16  23  14

In [326]:
#iloc index mantığı ile seçim
df.iloc[0:3] #3'e kadar 3 hariç [0,3)

   v1  v2  v3
0   3   6  28
1  14  16  27
2  19   9  14

In [327]:
df.iloc[0,0]

3

In [328]:
df.iloc[1,1]

16

In [329]:
df.iloc[:1,:1]

   v1
0   3

In [330]:
# df.loc[:1,:1] çalışmaz mutlak veri ister
df.loc[0:3,"v1"]

0     3
1    14
2    19
3    16
Name: v1, dtype: int32

In [331]:
df.iloc[0:3]["v1"]

0     3
1    14
2    19
Name: v1, dtype: int32

In [332]:
df.loc[0:1,"v2"]

0     6
1    16
Name: v2, dtype: int32

## Koşullu Eleman İşlemleri

In [333]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m, columns=["v1","v2","v3"])
df

   v1  v2  v3
0  26  22   3
1  10   7   2
2  22  20  17
3  21  26  29
4  15  28  28
5  24  16  10
6   7   4  16
7  28  22  22
8  22  17   8
9  13  13   4

In [334]:
df["v1"]

0    26
1    10
2    22
3    21
4    15
5    24
6     7
7    28
8    22
9    13
Name: v1, dtype: int32

In [335]:
df[0:2]

   v1  v2  v3
0  26  22   3
1  10   7   2

In [336]:
df[0:2]["v2"]

0    22
1     7
Name: v2, dtype: int32

In [337]:
df[0:2][["v1","v3"]]

   v1  v3
0  26   3
1  10   2

In [338]:
df[df.v1>5]

   v1  v2  v3
0  26  22   3
1  10   7   2
2  22  20  17
3  21  26  29
4  15  28  28
5  24  16  10
6   7   4  16
7  28  22  22
8  22  17   8
9  13  13   4

In [339]:
df[df.v1>15][["v1"]]

   v1
0  26
2  22
3  21
5  24
7  28
8  22

In [340]:
df[(df.v1>15)&(df.v3<10)][["v1","v3"]]

   v1  v3
0  26   3
8  22   8

In [341]:
df.loc[(df.v1>15) & (df.v3<10) , ["v1","v3"]]

   v1  v3
0  26   3
8  22   8

# Birleştirme

In [342]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(5,3))
df1=pd.DataFrame(m, columns=["v1","v2","v3"])
df1

   v1  v2  v3
0   9  19  19
1  12   2  11
2   7  14  26
3  23  22  27
4  11  14   5

In [343]:
df2=df+99
df2

    v1   v2   v3
0  125  121  102
1  109  106  101
2  121  119  116
3  120  125  128
4  114  127  127
5  123  115  109
6  106  103  115
7  127  121  121
8  121  116  107
9  112  112  103

In [344]:
pd.concat([df1,df2])

    v1   v2   v3
0    9   19   19
1   12    2   11
2    7   14   26
3   23   22   27
4   11   14    5
0  125  121  102
1  109  106  101
2  121  119  116
3  120  125  128
4  114  127  127
5  123  115  109
6  106  103  115
7  127  121  121
8  121  116  107
9  112  112  103

In [345]:
pd.concat([df1,df2],ignore_index=True)

     v1   v2   v3
0     9   19   19
1    12    2   11
2     7   14   26
3    23   22   27
4    11   14    5
5   125  121  102
6   109  106  101
7   121  119  116
8   120  125  128
9   114  127  127
10  123  115  109
11  106  103  115
12  127  121  121
13  121  116  107
14  112  112  103

In [346]:
df2.columns

Index(['v1', 'v2', 'v3'], dtype='object')

In [347]:
df2.columns=["v1","v2","a3"]

In [348]:
pd.concat([df1,df2])

    v1   v2    v3     a3
0    9   19  19.0    NaN
1   12    2  11.0    NaN
2    7   14  26.0    NaN
3   23   22  27.0    NaN
4   11   14   5.0    NaN
0  125  121   NaN  102.0
1  109  106   NaN  101.0
2  121  119   NaN  116.0
3  120  125   NaN  128.0
4  114  127   NaN  127.0
5  123  115   NaN  109.0
6  106  103   NaN  115.0
7  127  121   NaN  121.0
8  121  116   NaN  107.0
9  112  112   NaN  103.0

In [349]:
pd.concat([df1,df2], join="inner", ignore_index=True) #kesişimlere göre birleştir

     v1   v2
0     9   19
1    12    2
2     7   14
3    23   22
4    11   14
5   125  121
6   109  106
7   121  119
8   120  125
9   114  127
10  123  115
11  106  103
12  127  121
13  121  116
14  112  112

In [350]:
pd.concat([df1,df2],axis=0, join="outer")

    v1   v2    v3     a3
0    9   19  19.0    NaN
1   12    2  11.0    NaN
2    7   14  26.0    NaN
3   23   22  27.0    NaN
4   11   14   5.0    NaN
0  125  121   NaN  102.0
1  109  106   NaN  101.0
2  121  119   NaN  116.0
3  120  125   NaN  128.0
4  114  127   NaN  127.0
5  123  115   NaN  109.0
6  106  103   NaN  115.0
7  127  121   NaN  121.0
8  121  116   NaN  107.0
9  112  112   NaN  103.0

## İleri Birleştirme İşlemleri

In [351]:
import pandas as pd

In [352]:
#birebir birleştirme
df1=pd.DataFrame({"calisanlar": ["ali","veli","ayşe","fatma"],
                "grup": ["Muhasebe","Mühendislik","Mühendislik","IK"]})
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Mühendislik
2       ayşe  Mühendislik
3      fatma           IK

In [353]:
df2=pd.DataFrame({"calisanlar": ["ali","veli","ayşe","fatma"],
                "giriş": [2010,2009,2014,2019]})
df2

  calisanlar  giriş
0        ali   2010
1       veli   2009
2       ayşe   2014
3      fatma   2019

In [354]:
pd.merge(df1,df2)

  calisanlar         grup  giriş
0        ali     Muhasebe   2010
1       veli  Mühendislik   2009
2       ayşe  Mühendislik   2014
3      fatma           IK   2019

In [355]:
pd.merge(df1,df2,on="calisanlar")

  calisanlar         grup  giriş
0        ali     Muhasebe   2010
1       veli  Mühendislik   2009
2       ayşe  Mühendislik   2014
3      fatma           IK   2019

In [356]:
#Çoktan teke
df3=pd.merge(df1,df2)
df3

  calisanlar         grup  giriş
0        ali     Muhasebe   2010
1       veli  Mühendislik   2009
2       ayşe  Mühendislik   2014
3      fatma           IK   2019

In [357]:
df4=pd.DataFrame({"grup":["Muhasebe", "Mühendislik","IK"],
                "mudur":["caner","mustafa","berkcan"]})
df4

          grup    mudur
0     Muhasebe    caner
1  Mühendislik  mustafa
2           IK  berkcan

In [358]:
pd.merge(df3,df4)

  calisanlar         grup  giriş    mudur
0        ali     Muhasebe   2010    caner
1       veli  Mühendislik   2009  mustafa
2       ayşe  Mühendislik   2014  mustafa
3      fatma           IK   2019  berkcan

In [359]:
#Çoktan çoka
df5=pd.DataFrame({"grup":["Muhasebe","Muhasebe","Mühendislik","Mühendislik","IK","IK"],
                "yetenekler":["Matematik","Excel","Java","Linux","Excel","Yönetim"]})
df5

          grup yetenekler
0     Muhasebe  Matematik
1     Muhasebe      Excel
2  Mühendislik       Java
3  Mühendislik      Linux
4           IK      Excel
5           IK    Yönetim

In [360]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        ali     Muhasebe  Matematik
1        ali     Muhasebe      Excel
2       veli  Mühendislik       Java
3       veli  Mühendislik      Linux
4       ayşe  Mühendislik       Java
5       ayşe  Mühendislik      Linux
6      fatma           IK      Excel
7      fatma           IK    Yönetim

## Toplulaştırma ve Gruplama

(Aggregation & Grouping)

Basit Toplulaştırma Fonksiyonları
* count()
* first()
* last()
* mean()
* median()
* max()
* min()
* std()
* var()
* sum()

In [361]:
import seaborn as sns
import pandas as pd

In [362]:
#?sns.load_dataset

In [363]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [364]:
df.shape

(1035, 6)

In [365]:
df.info

<bound method DataFrame.info of                method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]>

In [366]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [367]:
df.mean()

C:\Users\ahmet\AppData\Local\Temp/ipykernel_6248/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [368]:
df["mass"].mean()

2.6381605847953233

In [369]:
df["mass"].count()

513

In [370]:
df["mass"].describe()

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [371]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [372]:
df["mass"].var()

14.58183312700122

In [373]:
df.describe().T #T transpozu alınmış

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [374]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri

In [375]:
df2 =pd.DataFrame({"gruplar":["a","b","c","a","b","c"],
                    "veri":[10,11,52,23,43,55]},
                    columns=["gruplar","veri"])
df2

  gruplar  veri
0       a    10
1       b    11
2       c    52
3       a    23
4       b    43
5       c    55

In [376]:
df2.groupby("gruplar")

In [377]:
df2.groupby("gruplar").mean()

         veri
gruplar
a        16.5
b        27.0
c        53.5

In [378]:
df2.groupby("gruplar").sum()

         veri
gruplar
a          33
b          54
c         107

In [379]:
df2.groupby("gruplar").describe()

         veri
        count  mean        std   min    25%   50%    75%   max
gruplar
a         2.0  16.5   9.192388  10.0  13.25  16.5  19.75  23.0
b         2.0  27.0  22.627417  11.0  19.00  27.0  35.00  43.0
c         2.0  53.5   2.121320  52.0  52.75  53.5  54.25  55.0

In [380]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [381]:
df.groupby("method")

In [382]:
df.groupby("method")["orbital_period"]

In [383]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [384]:
df.groupby("method")["mass"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## İleri Toplulaştırma İşlemleri

(Aggregate, Filter, Transform, Apply)

In [385]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [386]:
#aggregate
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [387]:
#Dilediğimiz hesaplamalar yer alsın istiyoruz
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [388]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

## Filter

In [389]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [390]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [391]:
def ff(x):
    return x["degisken1"].std()>9

In [392]:
df.groupby("gruplar").filter(ff)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [393]:
df.groupby("gruplar").filter(ff).std()

C:\Users\ahmet\AppData\Local\Temp/ipykernel_6248/807612038.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.groupby("gruplar").filter(ff).std()

degisken1     46.669048
degisken2    449.719913
dtype: float64

## Transform

Vektörel çalışıp, bir fonksiyonu değişkenler üzerinde çalıştırılmasına imkan verir.

In [394]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [395]:
df_a=df.iloc[:,1:3]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [396]:
df_a["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [397]:
df_a.transform(lambda x:(x-x.mean())/ x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

## Apply

Değerlere toplulaştırıcı işlemler yapılması için

In [398]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['degisken1', 'degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [399]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [400]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [401]:

df2 = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df2

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [402]:
df2.groupby("gruplar").apply(np.mean)

C:\Users\ahmet\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3417: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

## Pivot Tablolar

In [403]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [404]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [405]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [406]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [407]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [408]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [409]:
#Değişkeni değiştirme
age=pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [410]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663